qitas/acs-bitaxe-lcd-800x480/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M_DEFAULT=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
CONFIG_COMPILER_OPTIMIZATION_PERF=n
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_DATA_CACHE_LINE_SIZE=64
CONFIG_SPI_FLASH_HPM_DC_DISABLE=y

CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y
CONFIG_ESP_PANEL_LCD_BUS_SKIP_INIT_HOST=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_LOG=n
CONFIG_LV_LOG_PRINTF=n
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=y

CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_QRCODE=y
CONFIG_ESP_PANEL_USE_CUSTOM_BOARD=y
CONFIG_ESP_PANEL_USE_LCD=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="custom_8MB_3MB_spiffs.csv"
CONFIG_PARTITION_TABLE_FILENAME="custom_8MB_3MB_spiffs.csv"

CONFIG_EXAMPLE_UART_RXD=44
CONFIG_EXAMPLE_UART_TXD=43
CONFIG_EXAMPLE_PIN_MOSI=11
CONFIG_EXAMPLE_PIN_MISO=13
CONFIG_EXAMPLE_PIN_CLK=12
CONFIG_EXAMPLE_PIN_CS=-1
CONFIG_I2C_MASTER_SCL=9
CONFIG_I2C_MASTER_SDA=8

CONFIG_ESP_PANEL_LCD_CONTROLLER_ST7262=y
CONFIG_ESP_PANEL_LCD_WIDTH=800
CONFIG_ESP_PANEL_LCD_HEIGHT=480

CONFIG_ESP_PANEL_LCD_BUS_TYPE_RGB=y
CONFIG_ESP_PANEL_LCD_BUS_TYPE=3

CONFIG_ESP_PANEL_LCD_RGB_CLK_HZ=16000000
CONFIG_ESP_PANEL_LCD_RGB_HPW=4
CONFIG_ESP_PANEL_LCD_RGB_HBP=8
CONFIG_ESP_PANEL_LCD_RGB_HFP=8
CONFIG_ESP_PANEL_LCD_RGB_VPW=4
CONFIG_ESP_PANEL_LCD_RGB_VBP=16
CONFIG_ESP_PANEL_LCD_RGB_VFP=16
CONFIG_ESP_PANEL_LCD_RGB_PCLK_ACTIVE_NEG=y
CONFIG_ESP_PANEL_LCD_RGB_DATA_WIDTH_16=y
CONFIG_ESP_PANEL_LCD_RGB_DATA_WIDTH=16
CONFIG_ESP_PANEL_LCD_RGB_PIXEL_BITS=16

CONFIG_ESP_PANEL_LCD_RGB_IO_HSYNC=46
CONFIG_ESP_PANEL_LCD_RGB_IO_VSYNC=3
CONFIG_ESP_PANEL_LCD_RGB_IO_DE=5
CONFIG_ESP_PANEL_LCD_RGB_IO_PCLK=7
CONFIG_ESP_PANEL_LCD_RGB_IO_DISP=-1
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA0=14
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA1=38
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA2=18
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA3=17
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA4=10
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA5=39
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA6=0
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA7=45
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA8=48
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA9=47
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA10=21
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA11=1
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA12=2
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA13=42
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA14=21
CONFIG_ESP_PANEL_LCD_RGB_IO_DATA15=20

CONFIG_ESP_PANEL_LCD_COLOR_BITS_16=y
CONFIG_ESP_PANEL_LCD_COLOR_BITS=16
CONFIG_ESP_PANEL_LCD_COLOR_ORDER_RGB=y

CONFIG_ESP_PANEL_LCD_IO_RST=-1
CONFIG_ESP_PANEL_USE_TOUCH=y

CONFIG_ESP_PANEL_TOUCH_CONTROLLER_GT911=y
CONFIG_ESP_PANEL_TOUCH_H_RES=800
CONFIG_ESP_PANEL_TOUCH_V_RES=480

CONFIG_ESP_PANEL_TOUCH_BUS_SKIP_INIT_HOST=y
CONFIG_ESP_PANEL_TOUCH_BUS_TYPE_I2C=y
CONFIG_ESP_PANEL_TOUCH_BUS_TYPE=4
CONFIG_ESP_PANEL_TOUCH_BUS_HOST_ID=0
CONFIG_ESP_PANEL_TOUCH_I2C_ADDRESS=0
CONFIG_ESP_PANEL_TOUCH_IO_RST=-1
CONFIG_ESP_PANEL_TOUCH_IO_INT=-1